[
  {
    "title": "PUBG: BATTLEGROUNDS Weekly Bans Notice (03/03~03/09)",
    "date": "ANNOUNCEMENT 2025.03.12",
    "category": "PUBG",
    "platform": [],
    "link": "https://www.pubg.com/en/news/8296",
    "content": "Hello players!\n\n  \n\nWe are sharing the banned players list for the past week to raise awareness about the abuse of illegal software and the consequences of misconduct. Please refer to the list of players who have been banned for violating rules of conduct.\n\n*   Investigation Period: 2025/03/03~2025/03/09\n*   Click [here](https://wstatic-prod-boc.krafton.com/common/content/news/20250310/KcE3yte9/250312_WKBL\\(0303_0309\\).pdf) for the full list of permanently banned accounts\n\n![](https://wstatic-prod-boc.krafton.com/common/news/20250310/q6jRnwax.jpg)\n\n  \n\n※ The banned players list attached on this page shows the in-game nicknames of the permanently banned accounts, and the first 3 letters of each nickname have been replaced with \"\\*\".\n\n  \n\n※ Please report illegal software and misconduct through in-game reports first and if you need additional assistance, please contact [PUBG Support](https://support.pubg.com/hc/en-us).\n\n  \n\n※ To ensure that your valuable account is not abused or banned for using illegal software/misconduct, please make sure you sign up for Steam Guard Mobile Authenticator.\n\n  \n\n[※ How to Set Up Steam Guard Mobile Authenticator](https://support.pubg.com/hc/en-us/articles/115004196114-How-do-I-set-up-Steam-Guard-)\n\n  \n\n  \n\nWe highly value your interest and opinions that contribute to PUBG's anti-cheat efforts. \n\n  \n\nWe will do our best to provide a fair gaming environment.\n\n  \n\n  \n\nThank you.\n\n  \n\nPUBG: BATTLEGROUNDS Anti-Cheat Team\n\nPUBG: BATTLEGROUNDS Team."
  },
  {
    "title": "March Store Update 2025 Welcome to the third Store Update of 2025!",
    "date": "ANNOUNCEMENT 2025.03.11",
    "category": "PUBG",
    "platform": [],
    "link": "https://www.pubg.com/en/news/8275",
    "content": "Hello players!\n\nWelcome to the third Store update of 2025.\n\nMarch's Store update brings in a new **Survivor Pass**, a new **Progressive weapon skin and Chroma for the Mk12**, and the **Sisters of Sorcery collection**, and more!\n\n### **Hideout Update**\n\nBased on player feedback, **starting** **from** **Update 34.2**, the amount of materials obtained from salvaging Progressive weapon skins will scale with their level. Previously, salvaging a Progressive weapon skin provided a fixed amount of materials (Polymer x800, Schematic x3) regardless of its level. However, with Update 34.2, the materials obtained from salvaging will increase based on the Progressive weapon skin's level, as shown below.\n\n#### Materials Obtained From Salvaging Progressive Weapon Skins\n\nLevel\n\nPolymer\n\nSchematic\n\n1\n\n800\n\n3\n\n2\n\n1700\n\n4\n\n3\n\n3000\n\n6\n\n4\n\n4700\n\n8\n\n5\n\n6800\n\n10\n\n6\n\n9300\n\n13\n\n7\n\n12200\n\n16\n\n8\n\n15500\n\n19\n\n9\n\n19200\n\n22\n\n10\n\n23300\n\n26\n\n## **New Items and Skins**\n\n**※ The items below may reappear through other in-game platforms (such as the Workshop, Your Shop, etc.) and/or events and promotions even after their sales periods.**\n\n※ The sales periods shown below are subject to change.\n\n### Survivor Pass: Spirit Squad\n\nRally the team to a tasty Chicken Dinner victory in Survivor Pass: Spirit Squad!![](https://wstatic-prod-boc.krafton.com/common/news/20250307/RDthkXJ7.png)\n\n#### Sales Period (UTC)\n\n*   PC: March 12, after live server maintenance - April 9, 00:00\n*   Console: March 20, after live server maintenance - April 17, 00:00\n\n### Sisters of Sorcery\n\nGet ready to enchant the Battlegrounds with a spell sweeter than candy!![](https://wstatic-prod-boc.krafton.com/common/news/20250307/pBB3d1KX.png)\n\n#### Sales Period (UTC)\n\n*   PC: March 12, after live server maintenance - December 3, 00:00\n*   Console: March 20, after live server maintenance - December 11, 00:00\n\n## **Hideout: Weapon Skins**\n\n### Contraband Crate \n\n**_※ The probabilities for items obtainable from Contraband Crates can be found on the Hideout - Contraband - More Details - View Probabilities page._**\n\nPresenting a new Progressive weapon skin for the Mk12 to elevate your charm, along with the Pink Yellow Chroma!![](https://wstatic-prod-boc.krafton.com/common/news/20250307/LBNwSfqv.png)\n\n#### New Item\n\n*   Hocus Focus -  Contraband Crate\n\n**_※ Hocus Focus - Contraband Crate (Open 10) offers a 50% discount for the first purchase._**\n\n#### Sales Period (UTC)\n\n*   PC: March 12, after live server maintenance - August 13, 00:00\n*   Console: March 20, after live server maintenance - August 21, 00:00\n\n### Scrap Broker\n\n#### New Items\n\n*   \\[PROGRESSIVE\\] Hocus Focus - Mk12\n*   \\[CHROMA\\] Hocus Focus - Mk12 (Pink Yellow)\n\n#### Sales Period (UTC)\n\n*   PC: March 12, after live server maintenance - August 13, 00:00\n*   Console: March 20, after live server maintenance - August 21, 00:00\n\n### Collaboration Emote: Slickback\n\nGet ready for _the_ challenge! Feel the energetic rhythm sweeping across the Battlegrounds.![](https://wstatic-prod-boc.krafton.com/common/news/20250307/IdaRkPXE.png)\n\n#### Sales Period (UTC)\n\n*   PC: March 12, after live server maintenance - April 11, 00:00\n*   Console: March 20, after live server maintenance - April 19, 00:00\n\n### New Emote: Roll the Dice\n\nSettle it with a roll—use the new emote to roll the dice and see who wins! The winner gets the Lv.3 Helmet!![](https://wstatic-prod-boc.krafton.com/common/news/20250307/3VJQ13wc.jpg)\n\n#### Sales Start Date (UTC)\n\n*   PC: March 12, after live server maintenance\n*   Console: March 20, after live server maintenance\n\n### PUBG - 2025 PlayStation®Plus Exclusive Bundle #1\n\nThe first PlayStation®Plus bundle of 2025 has arrived! Claim yours to get Hunter’s Chests, Keys, and Contraband Coupons!![](https://wstatic-prod-boc.krafton.com/common/news/20250307/4ejXR1pk.png)\n\n#### Sales Period (UTC)\n\n*   Console (PlayStation®Plus): March 27, 17:00 - May 23, 01:00\n\n### PUBG - 2025 Xbox Game Pass Exclusive Survivor Pack #1\n\nXbox Game Pass players can also claim Hunter’s Chests, Keys, and Contraband Coupons with the first Survivor Pack of 2025!![](https://wstatic-prod-boc.krafton.com/common/news/20250304/Y48ftsCu.png)\n\n#### Sales Period (UTC)\n\n*   Console (Xbox Game Pass): March 27, 17:00 - May 23, 01:00\n\n  \n\nHappy shopping!\n\n  \n\nPUBG: BATTLEGROUNDS Team\n\nPUBG: BATTLEGROUNDS Team."
  },
  {
    "title": "Patch Notes - Update 34.2 Introducing Update 34.2: Discover all the latest features and improvements!",
    "date": "PATCH NOTES 2025.03.11",
    "category": "PUBG",
    "platform": [],
    "link": "https://www.pubg.com/en/news/8276",
    "content": "![](https://wstatic-prod-boc.krafton.com/common/news/20250310/yPGwIMoI.jpg)\n\n## \n\n* * *\n\n## **Live Main****tenance Schedule**\n\n※ The times shown below are subject to change.\n\n*   PC: March 12, 00:00 - 08:30 (UTC)\n*   Console: March 20, 01:00 - 09:00 (UTC)\n\n* * *\n\n## **Map Service**\n\n_※ PC players can anticipate the next rotation every Wednesday at 02:00 UTC, while Console players can expect the same every Thursday at 07:00 UTC._\n\n### Schedule\n\nStart Date\n\nPC\n\nConsole\n\nWeek 1\n\nMarch 12\n\nMarch 20\n\nWeek 2\n\nMarch 19\n\nMarch 27\n\nWeek 3\n\nMarch 26\n\nApril 3\n\nWeek 4\n\nApril 2\n\nApril 10\n\n### **Live Server - Normal Match**\n\n#### **Map Select Regions (AS, SEA)**\n\n  \n\nFixed  \n\nFavored Map   \n(Rondo, Miramar, Taego)  \nRotation\n\nEtc.\n\n(Paramo, Vikendi, Karakin, Deston)\n\nWeek 1\n\nErangel\n\nSanhok\n\nTaego\n\nMiramar\n\nVikendi\n\nWeek 2\n\nErangel\n\nSanhok\n\nMiramar\n\nRondo\n\nKarakin\n\nWeek 3\n\nErangel\n\nSanhok\n\nRondo\n\nTaego\n\nDeston\n\nWeek 4\n\nErangel\n\nSanhok\n\nTaego\n\nMiramar\n\nParamo\n\n#### **Map Select Regions - KAKAO**\n\n  \n\nFixed\n\nFavored Map  \n(Miramar, Rondo)  \nRotation\n\nEtc.  \n(Paramo, Vikendi, Karakin, Deston)\n\nWeek 1\n\nErangel\n\nTaego\n\nSanhok\n\nRondo\n\nKarakin\n\nWeek 2\n\nErangel\n\nTaego\n\nSanhok\n\nMiramar\n\nDeston\n\nWeek 3\n\nErangel\n\nTaego\n\nSanhok\n\nRondo\n\nParamo\n\nWeek 4\n\nErangel\n\nTaego\n\nSanhok\n\nMiramar\n\nVikendi\n\n####   \n**Random Map Regions - NA, SA, EU, RU & Console**\n\n**_※ Rotations featuring Deston will have a 20% probability for each map. For Weeks 1 and 3, fixed and favored maps will each have a 22% probability and etc. maps will be 11% each._**\n\n  \n\nFixed\n\nFavored Map  \n(Taego, Rondo, Vikendi, Miramar)  \nRotation\n\nEtc.\n\n(Deston, Sanhok, Karakin, Paramo)\n\nWeek 1\n\nErangel\n\nRondo\n\nVikendi\n\nMiramar\n\nKarakin\n\nWeek 2\n\nErangel\n\nVikendi\n\nMiramar\n\nTaego\n\nDeston\n\nWeek 3\n\nErangel\n\nMiramar\n\nTaego\n\nRondo\n\nSanhok\n\nWeek 4\n\nErangel\n\nTaego\n\nRondo\n\nVikendi\n\nDeston\n\n### Live Server - Ranked\n\n*   **Erangel (25%) / Miramar (25%) / Taego (20%) / Rondo (20%) / Vikendi (10%)**\n*   The map service for Ranked is updated on a season-by-season basis.\n\n* * *\n\n**※ Please note that the features and updates described below are subject to change or removal due to issues such as bugs, in-game problems, and community feedback. The images are intended as visual references only; the actual game may look different as the builds are continually developed and refined before release.**\n\n* * *\n\n## PU8G: 8th Anniversary\n\nEight years ago, you took your first steps onto unfamiliar and unforgiving battlegrounds. Since that moment, every battle fought alongside you has become part of PUBG's legacy. The fierce struggles for survival, the exhilaration of victory, and the countless stories woven through camaraderie—all of it has led us to this moment of celebration.\n\nThis year, the battlegrounds shine brighter than ever. **Golden Grenades glisten in the heat of battle**, and the **8th Anniversary Bobble Bot** joins the festivities along with **towering billboards, dazzling fireworks,** and a **party ferry**. Excitement pulses through the battlegrounds, and the celebration is in full swing!\n\nPUBG's 8th Anniversary is here—are you ready to join the festivities? Jump in now and experience the golden glow of this special celebration!\n\n### Party on the Battlegrounds\n\n※ The following updates apply to Normal Match and Ranked.\n\nTo celebrate our 8th anniversary, something massive and wobbly has appeared on the starting island... Before the match begins, try tossing a Golden Grenade at the Bobble Bot! When the total hits reach special milestones, the names of players who landed hits will be displayed on the billboard.![](https://wstatic-prod-boc.krafton.com/common/news/20250310/nQz8ed7L.jpg)\n\n*   Both the Bobble Bot and Golden Grenade are available on the starting island of every map.\n\nNo celebration is complete without a spectacle! For the 8th anniversary, an even more dazzling fireworks display will light up the skies.![](https://wstatic-prod-boc.krafton.com/common/news/20250310/bk8rPeQ9.jpg)\n\n*   Fireworks will go off before the option to drop from the plane becomes available.\n*   Starting planes will also bear anniversary banners.\n\nErangel's ferry transforms into the festive 8th Anniversary Party Ferry, while two bridges and the docks are decorated in an 8th Anniversary theme.![](https://wstatic-prod-boc.krafton.com/common/news/20250310/MozdmHdg.jpg)![](https://wstatic-prod-boc.krafton.com/common/news/20250310/ASZrfGdt.jpg)\n\nIn lookout towers, once used to catch your breath or covertly scout enemies, anniversary decorations and birthday cakes have been placed so you can celebrate the 8th anniversary with your teammates. Host celebration parties all across Erangel!![](https://wstatic-prod-boc.krafton.com/common/news/20250310/zWg68Km5.jpg)\n\nYou can also find gift boxes hanging from eight balloons, commemorative containers, and newly revamped lampposts throughout Erangel.![](https://wstatic-prod-boc.krafton.com/common/news/20250310/qBBvrxw8.jpg)\n\n※ The 8th Anniversary Gift Box appears only in Normal Match.![](https://wstatic-prod-boc.krafton.com/common/news/20250310/UyVpXsRs.jpg)\n\n*   Energy Drinks and Care Packages are also wrapped in the spirit of celebration.\n\n![](https://wstatic-prod-boc.krafton.com/common/news/20250310/WmIjcMq3.jpg)\n\n*   Erangel, Miramar, Sanhok, Vikendi, and Rondo are adorned with an array of anniversary decorations. Billboards and digital screens light up, among other celebratory additions.\n\n### New Lobby Music\n\nFor PUBG's 8th anniversary, we teamed up with M83 to bring a special touch to our lobby music. Led by Anthony Gonzalez, M83 is renowned for their atmospheric, cinematic sound, with hits like _Midnight City_ and acclaimed film scores. Get ready to drop in with an immersive soundtrack that sets the perfect mood for battle!\n\n* * *\n\n## **Gunplay Labs: Aim Punch 2**\n\nIntroducing the second round of Gunplay Labs: Aim Punch, featuring a refined aim punch system based on player feedback from Update 33.2.![](https://wstatic-prod-boc.krafton.com/common/news/20250310/sCYfyLec.jpg)\n\n### Schedule (UTC)\n\n*   PC\n    *   March 12, after live server maintenance - March 26, 00:00\n*   Console\n    *   March 20, after live server maintenance - April 3, 01:00\n\n### Details\n\n*   **Mode**: Intense Battle Royale\n*   **Perspective**: TPP Only\n*   **Party type**: Squad Only\n*   The types of Random Weapon Crates given at the start of the match are the following:\n    *   AR, SMG, DMR/SR, SG\n\n_**※**_ _**Arcade Points will be granted for Gunplay Labs: Aim Punch 2 play sessions.**_\n\n### Aim Punch Adjustments\n\nThe aim punch system you experienced in Gunplay Labs: Aim Punch has been adjusted in Gunplay Labs: Aim Punch 2 as follows.\n\n*   We have reduced the dizziness caused by significant screen movement in the previous Gunplay Labs.\n*   For Aim Punch 2, we will implement a system where aim punch decreases with distance.\n    *   The aim punch of SMGs and shotguns decreases significantly with distance. At 50 meters, SMGs have similar aim punch to ARs.\n        \n    *   SRs also experience a distance-based reduction in aim punch, but they still have a strong aim punch at mid-range.\n    *   ARs and DMRs have a marginally higher base aim punch than in the current game version, but beyond 100 meters, the aim punch decreases to levels comparable to the current game.\n*   In Gunplay Labs: Aim Punch 2, the VSS now has the same level of aim punch as SMGs.\n\n_Dev's comment:_ _In January, Gunplay Labs: Aim Punch introduced a new take on aim punch, and we received a lot of valuable feedback from players. After carefully reviewing your input and recognizing key concerns, we've decided to run a second round of Gunplay Labs focused on refining the system. In the upcoming Gunplay Labs: Aim Punch 2, you'll experience a more polished version of the aim punch mechanics. We've kept its core characteristics intact but made adjustments to reduce discomfort, such as dizziness effects. One of the biggest changes is the introduction of a distance-based aim punch reduction system, designed to create a more realistic experience. Additionally, based on feedback that testing new mechanics was challenging, Gunplay Labs: Aim Punch 2 will take place in Intense Battle Royale mode, ensuring more frequent engagements and better testing opportunities. After this session, we'll continue to analyze gameplay data and listen to your feedback to further evaluate the system. We appreciate your participation and look forward to hearing your thoughts!_\n\n* * *\n\n## World: Sanhok![](https://wstatic-prod-boc.krafton.com/common/news/20250310/8BJe1eBc.jpg)![](https://wstatic-prod-boc.krafton.com/common/news/20250310/WxceaBoW.jpg)\n\n*   Improved the interior lighting of buildings across the map.\n\n* * *\n\n## Arcade\n\n※ The following updates apply to Custom Match as well.\n\n### Team Deathmatch![](https://wstatic-prod-boc.krafton.com/common/news/20250310/nixyyCFq.jpg)\n\n*   The following three maps have been added.\n    *   Deston - Arena\n    *   Vikendi - Train Station\n    *   Sanhok - Camp Bravo\n*   Map selection probabilities have been readjusted in alignment with these changes.\n*   Destruction features have been added to Sanhok maps.\n*   Spawn Kit Changes\n    *   Ammo provided for SMGs: 150 → 180\n    *   The Secondary Weapon for SMGs has been changed from Deagle → P92.\n    *   Laser Sight has been added to attachments for SMGs.\n\n### Intense Battle Royale\n\n*   Previously, existing maps and random maps each made up 50% of total map appearances. Now, this will change to 100% random maps.\n*   Destruction features have been added to Sanhok maps.\n*   The attachments for weapons obtained from Random Weapon Crates have been changed.\n    *   ARs: Flash Hider → Muzzle Brake\n    *   SMGs: Flash Hider → Compensator\n    *   DMRs/SRs: Flash Hider → Suppressor\n*   Random LMG Crate has been added.\n    *   Can obtain M249 or DP-28.\n*   The red Supply Drops now contain attachments.\n*   The default Throwable equipped at the start of the match has been changed from the Molotov Cocktail to the Frag Grenade.\n*   The maximum player count in Custom Match has increased from 24 -> 100.\n\n### Hot Drop\n\n*   **Maximum number of starting players**\n    *   PC: 48 → **64**\n*   **Spawns**\n    *   The overall item spawn rate has been reduced by approximately 15%.\n\n_Dev's comment: In this Hot Drop mode update, we're reverting the changes that were applied when the mode became permanent. By restoring the maximum player count, we aim to amplify the intense battles that define Hot Drop mode. Additionally, spawn rates have been reverted to their original levels, aiming to provide a gameplay experience similar to what you encountered when the mode first launched. Furthermore, we've optimized performance to deliver a smoother gameplay experience._\n\n* * *\n\n## Gameplay\n\n### Bot Refinement\n\n*   Bots have been enhanced to behave more naturally.\n    *   The difficulty of fighting bots remains similar to before.\n\n* * *\n\n## **Matchmaking**\n\n### **(PC) Same Language Team**\n\nThe Same Language Team feature will be available for Ranked starting from Update 34.2.![](https://wstatic-prod-boc.krafton.com/common/news/20250310/a4d6u9mB.jpg)\n\n*   In Squad mode, enable the \"Same Language Team\" option located above the Select Game Mode panel in the Play - Ranked tab to be matched with teammates who use the same language as the party leader. \n*   Unlike Normal Match, matchmaking will not be canceled even after a certain period of time.\n\n* * *\n\n## Survivor Pass\n\n※ Starting from Update 34.2, the reset time for Console daily missions will change from 09:00 → 02:00 UTC.![](https://wstatic-prod-boc.krafton.com/common/news/20250310/G92Tpz47.png)\n\nA brand new Survivor Pass is prepared for Update 34.2. Read more details on the **March Store Update** announcement!\n\n* * *\n\n## **Settings**\n\n*   For Effects options below 'Ultra,' the number of fragments generated during building destruction on the Sanhok map has been reduced. \n    *   This adjustment is expected to reduce system load but will result in simplified visual effects.\n    *   The Effects option can be adjusted under Settings - Graphics - Advanced - Effects.\n\n* * *\n\n## UX/UI\n\n※ The following updates apply to Normal Match and Ranked.![](https://wstatic-prod-boc.krafton.com/common/news/20250310/4ZnWYB1q.jpg)![](https://wstatic-prod-boc.krafton.com/common/news/20250310/ZZ0sTRl1.jpg)\n\n*   Kill/knockdowns by teammates will now be displayed in the center-bottom kill message area.\n*   Teammates' kill messages will now be shown while spectating them.\n*   Killfeed visibility has been improved, and a new kill icon with an overlapping X on the knockdown icon has been added: \n    *   White X: Standard kill/death icon\n    *   Red X: Indicates your or a teammate's death\n    *   Blue X: Indicates your or a teammate's kill\n*   The kill/knockdown icons on the Career - Match History - Match Report - Overview page have been updated to reflect the recent changes.\n    \n*   The match join UI displayed in the top-right corner on the starting island has been replaced with a new match join notification message.\n    \n*   Preview images for Random Crate items have been added.\n    \n*   In the Random Crate preview screen, you can check item details by selecting the crate and clicking the 'View More' button on the right.\n    \n*   Battlestat weapon skins' total kills and headshot kills can now be viewed in a tooltip when hovering over the skin on the Customize - Weapons page.\n    \n*   Clicking the preview button for Progressive weapon skins on the Customize - Weapons page will now take you to the Hideout.\n*   A preview button has been added to most items on the Crafter Pass and Survivor Pass pages, except for a few exclusions.\n    \n\n* * *\n\n## **Lobby**\n\n*   (PC) Left and right buttons have been added to the top-right lobby banner, allowing you to browse through banners as desired.\n\n* * *\n\n## **Bug Fixes**\n\n### Gameplay\n\n*   Fixed an issue in Team Deathmatch where, on maps with Ascenders, ending a round while riding an Ascender prevents it from being used in the next round.\n*   Fixed an issue where using a certain Emote allows players to see beyond walls.\n*   Fixed an issue where, in certain situations during 1v1 Arena, ammo fails to be provided at the start of a round.\n*   Fixed an issue where, in FPP mode, rotating 360 degrees while riding the Motorbike causes the screen to flip abnormally.\n\n### World\n\n*   Fixed collision, texture, performance, and some other general Sanhok and Vikendi issues.\n*   Fixed an issue where bumps on the road near Tat Mok in the Sanhok map obstruct character movement.\n*   Fixed an issue where Smoke Grenades fail to deploy on a certain structure in the Rondo map.\n\n### UX/UI\n\n*   Fixed an issue where the item count UI on the Observer's screen fails to update when players drop healing items or Throwables.\n*   Fixed an issue where the Blue Zone icon in the killfeed displays abnormally on the Observer's screen.\n*   Fixed an issue where, in Sandbox Mode, using Sandbox features to revive after a full team wipe while in spectator mode causes the team UI to disappear.\n*   Fixed an issue where a player's death marker UI fails to appear on the World Map and Minimap when spectating a teammate after death.\n*   (PC) Fixed an issue where the scrollbar in the Career - Weapons page fails to function in certain areas.\n\n### Items & Skins\n\n※ Clipping issue: Graphics that are shown outside the visible part of an image/object.\n\n*   Fixed an issue where, when driving a vehicle with the \"Countach LPI 800-4\" Sports Car skin equipped, steering while looking back causes the character's steering animation to play in the opposite direction.\n*   Fixed an issue where the ankles become transparent when wearing the Cerberus' Pants with certain boots.\n*   Fixed the clipping issue when the female character wears the Vigilante Shoes and certain pants together.\n*   Fixed an issue where the texture of the Lemon Drops - Helmet (Level 2) item displays abnormally.\n*   Fixed an issue where equipping the \\[CHROMA\\] Cyber Threat - Mk12 (Khaki Burgundy) skin causes the 6x Scope to appear broken.\n*   Fixed an issue where, upon respawning after death in Team Deathmatch, the Rare Skin Cosmetics effects of Progressive weapon skins occasionally fail to display.\n\nPUBG: BATTLEGROUNDS Team."
  },
  {
    "title": "Workshop Updates",
    "date": "ANNOUNCEMENT 2025.03.07",
    "category": "PUBG",
    "platform": [],
    "link": "https://www.pubg.com/en/news/8272",
    "content": "Hello players,\n\nOn **April 9, Update 35.1** will bring changes to the Workshop's Artisan Crafting and the Archivist's Chest. We're sharing the details in advance so you can review them before Update 35.1 goes live in April.\n\n## Workshop Updates\n\n### Artisan Crafting\n\nWith Update 35.1, 12 out of the 16 existing Artisan Crafting sets will no longer be available for purchase, except for the four sets listed below. However, the 12 discontinued sets may return in the future through periodic resales.\n\n※ The four sets listed below will require re-registration in the system during the Update 35.1 maintenance. As a result, sale-ending notifications will be displayed for these four sets on the Artisan Crafting page, but **these sets will remain available for purchase after the update.**\n\n※ **Additionally, after the re-registration, the following four sets will be displayed as craftable items even for players who already own them. Please keep this in mind.**\n\n#### Items List\n\n*   Apocalypse Set\n*   Desert Enforcer Set\n*   Demon Thrall Set\n*   Demon Biker Set\n\n### Archivist's Chest\n\nIn Update 35.1, the items obtainable from the Archivist's Chest will be upgraded. Further details will be provided at a later date. Additionally, after Update 35.1 maintenance is over, **the upgraded item pool will be applied to any unopened Archivist's Chests purchased before the update**.\n\nNext, the list of Archivist's Chest bundles currently available in the Store will be updated as follows.\n\n#### As-Is\n\n*   Archivist's Chest Bundle (x1)\n*   Archivist's Chest Bundle (x5)\n*   Archivist's Chest Bundle (x10)\n\n#### To-Be\n\n*   Archivist's Chest Bundle (x1)\n*   Archivist's Chest Bundle (x10)\n*   Archivist's Chest Bundle (x25)\n*   Archivist's Chest Bundle (x50)\n\nThank you.\n\n  \n\nPUBG: BATTLEGROUNDS Team\n\nPUBG: BATTLEGROUNDS Team."
  },
  {
    "title": "DEV DROP: Sanhok Destruction & Ask PUBG Anything",
    "date": "ANNOUNCEMENT 2025.03.06",
    "category": "PUBG",
    "platform": [],
    "link": "https://www.pubg.com/en/news/8265",
    "content": "Hello players!\n\nThe second DEV DROP is here, bringing you a new topic: Sanhok Destruction! Once again, Director Taehyun Kim shares honest answers to questions and feedback from players around the world.\n\nWhile working on DEV DROP, we realized that many players have questions that aren't necessarily tied to a specific update. So, we thought—why not take this chance to answer some of those too?\n\nThat's why we've put together \"Ask PUBG Anything\"—a collection of answers to some of your burning questions that didn't make it into the video. Be sure to check it out after watching DEV DROP, and we hope you enjoy!\n\n# DEV DROP: Sanhok Destruction\n\n<span class=\"fr-mk\" style=\"display: none;\">&nbsp;</span>\n\n# Ask PUBG Anything\n\n**Q.** Can you make it possible to set different weapon/Smoke Grenade/Pan skins for each preset?\n\n**A.** We know our players have a variety of opinions on presets. We will carefully review feedback from the community and other sources to identify potential improvements.\n\n  \n\n**Q.**\n\n*   Can you add a feature to remove duplicate skins obtained from events?\n*   The issue of repeatedly receiving duplicate skins persists. Do you plan to continue releasing content that allows players to obtain duplicate skins?\n\n**A.** We are fully aware of the issue with Event tier items, as they cannot be exchanged for BP or disassembled, making it difficult to manage them efficiently when they accumulate in the inventory. To address this, we plan to introduce a feature that allows players to remove Event tier items if they choose to.\n\n  \n\n**Q.** Some players have their Reputation levels lowered due to team kills or false reports when encountering a three-man squad engaging in unsportsmanlike behavior. Can you introduce improvements for such situations?\n\n**A.** We are aware that players can become victims of team kills or false reports. We will discuss possible improvements internally to ensure fair players are not unjustly penalized due to others' misconduct.\n\n  \n\n**Q.** Are there any plans to address players who join matches via random squad matchmaking and go AFK to exploit events?\n\n**A.** Please report such players under 'griefing or toxic behavior' with video evidence or relevant data. We will review the report and take appropriate actions.\n\n  \n\n**Q.** Do you have any plans to re-release past collaboration skins?\n\n**A.** We are actively considering re-releasing previously launched collaboration skins. However, this is not a simple process, as collaborations require IP holder approvals and are subject to contractual limitations. Please share which IPs you'd like to see return in the community. Your feedback will help us prioritize the most requested collaborations.\n\n  \n\n**Q.** What is the timeline for implementing two-step authentication in the game? \n\n**A.** We have seen the ongoing feedback in the community regarding account security and the two-step authentication. To better protect our dedicated players, we are preparing to introduce this feature this year. We will share further details once the timeline is confirmed.\n\n  \n\n**Q.** When will the destruction mechanics be added to all maps?  \n\n**A.** The Destructible Terrain feature, first introduced in Rondo, will be gradually implemented in Taego, Miramar, and Erangel. As for the destructible buildings and objects introduced in Sanhok, there are still various factors to consider, such as performance issues and gameplay balance. We are carefully evaluating whether expanding this feature to other maps is the right decision.\n\n  \n\n**Q.** Is there a possibility of adding progressive costumes to the game?\n\n**A.** We will be able to share more details about this when we release the 2025 roadmap soon.\n\n  \n\n**Q.** Question about the matchmaking system: Why are my teammates below level 100 when my Survivor Mastery Level is 2500?\n\n**A.** The Survivor Mastery Level increases based on playtime and does not directly reflect player skill level. The matchmaking for Normal Match is based on MMR, which is calculated from various factors such as placement, kills, and other performance metrics in each match. We continuously update the MMR system to ensure it accurately reflects player skill. Please note that the MMR range among players tends to be narrower during peak hours and wider during off-peak hours.\n\n  \n\n**Q.** Can you add a search function for items? Please make it easier to find them.\n\n**A.** We are not currently developing a search system based on item names, but we are working on a system with better filtering features to help players find items more efficiently. \n\n  \n\n**Q.** The current system only allows reporting players for negative behavior. Will there be a feature to commend teammates or opponents for positive actions? Are there any plans for special interactive features?\n\n**A.** The compliment feature was added to the live servers in July 2023. Players can commend their teammates using three types of compliments, and receiving positive feedback increases a player's Reputation level. You can find more details in the July 2023 Patch Notes (#24.2). However, since PUBG is a battle royale game where only one can be the last survivor, a system to praise opponents is not currently under consideration. \n\n  \n\n**Q.** Will you add an immediate countermeasure against intentional team killers, such as preventing them from looting or moving?\n\n**A.** Allowing players to immediately punish team killing could be exploited, making it an unviable option. However, we acknowledge ongoing player concerns about team kills and will continue to explore ways to address this issue. \n\n  \n\n**Q.** Can you allow players to place multiple markers on the map? For example, allowing a player to set two or more markers would help teams coordinate better by highlighting multiple items and locations.\n\n**A.** We will review potential improvements to the ping system.\n\n  \n\n**Q.** Why is there no longer a test server for game updates? Previously, early access on test servers helped identify issues in advance.\n\n**A.** For a test server to be effective, it needs a substantial player base to ensure proper matchmaking. However, participation rates were low, making it difficult to gather meaningful feedback. Instead, we are using alternative methods, such as Labs in the Arcade, to showcase key features, engage in discussions with players, and gather more feedback before implementation.\n\n  \n\n**Q.** Why are there so many currencies in PUBG? Wouldn't it be good to only have a handful and not so many, as it can be very confusing?\n\n**A.** We recognize that the variety of in-game currencies may be a barrier for players unfamiliar with PUBG's currency system. However, our goal is to provide diverse and enjoyable out-of-match experiences through the current system. While we have no plans to reduce the number of currencies, we are continuously exploring ways to improve the overall player experience.\n\n  \n\n**Q.** Why are you promoting TPP in Esports and don't stick to FPP like most of the other FPS games?\n\n**A.** Both Ranked and Esports aim to provide competitive challenges for players. We have previously emphasized the importance of bridging the gap between playing and watching the game. While FPP has a dedicated fan base, TPP is still significantly more popular across all regions. Therefore, we are committed to delivering both an exciting viewing experience and competitive challenges for our TPP players as well. \n\n  \n\n**Q.** Some ARs like the SCAR-L, Mk47 Mutant and M16A4 are weak compared to others, are you going to buff them?\n\n**A.** We are preparing balance updates and meta adjustments this year, just like last year. Rather than focusing on individual weapons, we prioritize striking balance across weapon categories. A good example is the buffs we applied to SMGs last year to increase their viability. While we will continue refining the balance among individual weapons, our primary focus remains on ensuring balance across different weapon types.\n\n  \n\n**Q.** What are you going to do with the Thermal Scope? We provide feedback every week that the item is too strong and doesn't belong in PUBG.\n\n**A.** We are fully aware of the feedback on the Thermal Scope, especially from the Western community. We have conducted extensive reviews and discussions, and details on changes to the Thermal Scope and other map-specific items will be shared in the upcoming roadmap. \n\n  \n\n**Q.** Why is the Panzerfaust in Ranked/Esports? We provide feedback every week that the item belongs to casual games and not in a competitive setting?\n\n**A.** We believe that aligning gameplay experiences across Normal Match, Ranked, and Esports is more important than ever. By actively incorporating diverse content from Normal Match into Ranked, we aim to reduce gameplay discrepancies and encourage more players to participate in Ranked and Esports. If balance adjustments are needed—such as changes to performance, spawn rates, or mechanics—we will actively consider player feedback, just as we previously adjusted the Panzerfaust’s firing mechanics. \n\n  \n\n**Q.** Tell us more about PUBG and UE5. Will it be a separate game, or will the current version gradually evolve?\n\n**A.** We will be sharing insights on PUBG's future development direction, including long-term plans, in the upcoming 2025 roadmap. Stay tuned! \n\n  \n\n**Q.** Tell us about the fight against cheaters. Are you focusing more on banning cheaters or closing vulnerabilities to make cheating increasingly difficult?\n\n**A.** We are actively addressing both aspects you mentioned. Our approach focuses on not only banning cheaters but also strengthening anti-cheat measures and closing security loopholes to stay ahead of rapidly evolving illegal software.\n\n  \n\n**Q.** Last year, there was an awesome collaboration with Automobili Lamborghini. Will there be similar collaborations this year, and if so, with whom?\n\n**A.** We have exciting collaborations with premium automobile brands lined up for this year. Stay tuned for official announcements!\n\n* * *\n\n  \n\nWe hope this has answered some of your questions, and we'll wrap it up here for today.\n\nSee you again with the next DEV DROP!\n\n  \n\nPUBG: BATTLEGROUNDS Team\n\nPUBG: BATTLEGROUNDS Team."
  },
  {
    "title": "PUBG: BATTLEGROUNDS Weekly Bans Notice (02/24~03/02)",
    "date": "ANNOUNCEMENT 2025.03.05",
    "category": "PUBG",
    "platform": [],
    "link": "https://www.pubg.com/en/news/8274",
    "content": "Hello players!\n\nWe are sharing the banned players list for the past week to raise awareness about the abuse of illegal software and the consequences of misconduct. Please refer to the list of players who have been banned for violating rules of conduct.\n\n*   Investigation Period: 2025/02/24~2025/03/02\n*   Click [here](https://wstatic-prod-boc.krafton.com/common/content/news/20250304/0V5QDJGn/250305_WKBL\\(0224_0302\\).pdf) for the full list of permanently banned accounts\n\n![](https://wstatic-prod-boc.krafton.com/common/news/20250304/1XjqAH7s.jpg)  \n\n※ The banned players list attached on this page shows the in-game nicknames of the permanently banned accounts, and the first 3 letters of each nickname have been replaced with \"\\*\".\n\n※ Please report illegal software and misconduct through in-game reports first and if you need additional assistance, please contact [PUBG Support](https://support.pubg.com/hc/en-us).\n\n※ To ensure that your valuable account is not abused or banned for using illegal software/misconduct, please make sure you sign up for Steam Guard Mobile Authenticator.\n\n[※ How to Set Up Steam Guard Mobile Authenticator](https://support.pubg.com/hc/en-us/articles/115004196114-How-do-I-set-up-Steam-Guard-)\n\n  \n\nWe highly value your interest and opinions that contribute to PUBG's anti-cheat efforts. \n\nWe will do our best to provide a fair gaming environment.\n\n  \n\nThank you.\n\nPUBG: BATTLEGROUNDS Anti-Cheat Team\n\nPUBG: BATTLEGROUNDS Team."
  },
  {
    "title": "PUBG: BATTLEGROUNDS Weekly Bans Notice (02/17~02/23)",
    "date": "ANNOUNCEMENT 2025.02.26",
    "category": "PUBG",
    "platform": [],
    "link": "https://www.pubg.com/en/news/8261",
    "content": "Hello players!\n\nWe are sharing the banned players list for the past week to raise awareness about the abuse of illegal software and the consequences of misconduct. Please refer to the list of players who have been banned for violating rules of conduct.\n\n*   Investigation Period: 2025/02/17~2025/02/23\n*   Click [here](https://wstatic-prod-boc.krafton.com/common/content/news/20250224/WpUF4xZ1/250226_WKBL\\(0217_0223\\).pdf) for the full list of permanently banned accounts\n\n![](https://wstatic-prod-boc.krafton.com/common/news/20250224/GQ2SETt7.jpg)\n\n  \n\n※ The banned players list attached on this page shows the in-game nicknames of the permanently banned accounts, and the first 3 letters of each nickname have been replaced with \"\\*\".\n\n※ Please report illegal software and misconduct through in-game reports first and if you need additional assistance, please contact [PUBG Support](https://support.pubg.com/hc/en-us).\n\n※ To ensure that your valuable account is not abused or banned for using illegal software/misconduct, please make sure you sign up for Steam Guard Mobile Authenticator.\n\n[※ How to Set Up Steam Guard Mobile Authenticator](https://support.pubg.com/hc/en-us/articles/115004196114-How-do-I-set-up-Steam-Guard-)\n\n  \n\nWe highly value your interest and opinions that contribute to PUBG's anti-cheat efforts. \n\nWe will do our best to provide a fair gaming environment.\n\n  \n\nThank you.\n\nPUBG: BATTLEGROUNDS Anti-Cheat Team\n\nPUBG: BATTLEGROUNDS Team."
  },
  {
    "title": "Squad Battle Returns on February 21, 2025 Two teams. Eight content creators. 1v1 Arena duels and Battle Royale clashes. Who will rise to the top? Tune in live and be part of the action!",
    "date": "ANNOUNCEMENT 2025.02.20",
    "category": "PUBG",
    "platform": [],
    "link": "https://www.pubg.com/en/news/8248",
    "content": "<span class=\"fr-mk\" style=\"display: none;\">&nbsp;</span> \n\n  \n\n**Squad Battle is here!** Get ready for an intense showdown on **February 21st, 2025**, starting at **18:00 UTC**. Two teams, featuring eight top content creators, will face off in **1v1 Arena duels and Battle Royale matches**, fighting for a **$10,000 USD** and ultimate bragging rights.\n\n**Who are the Challengers?**\n\n  \n\nSome of the best content creators are stepping up to the challenge!\n\n  \n\n**Team DanucD**\n\n**Team Glorious\\_E**\n\n[DanucD](https://www.twitch.tv/danucd)\n\n[Glorious\\_E](https://www.twitch.tv/Glorious_E)\n\n[Eastahh](https://www.twitch.tv/eastahh)\n\n[Alisa](https://www.twitch.tv/alisa)\n\n[C\\_Dome](https://www.twitch.tv/c_dome)\n\n[Lauraa](https://www.twitch.tv/lauraa)\n\n[Halifax](https://www.twitch.tv/halifax)\n\n[Rollipollipotamus](https://www.twitch.tv/rollipollipotamus)\n\n  \n\nTune in live on [**Twitch at /PUBG\\_BATTLEGROUNDS**](https://www.twitch.tv/pubg_battlegrounds) to catch all the action, with POVs from each content creator’s stream—with the amazing TheBeardGuys as your host and caster!\n\n  \n\nAnd don’t miss out—G-Coin rewards will be up for grabs for viewers throughout the event!  \n  \n\nFind all the details and terms for our promotion [here](https://wstatic-prod-boc.krafton.com/common/content/news/20250214/DFpLh2ub/PUBG%20SQUAD%20BATTLE_3_Promotion%20Rules_final_250211.pdf).\n\n  \n\n**Predict your winner!**\n\n![](https://wstatic-prod-boc.krafton.com/common/news/20250221/7xgSJtJQ.jpg)\n\n  \n\nThink you can predict the winners? Now’s your chance! Submit your predictions before the start of the Squad Battle event for a shot at winning **1,000 G-Coin**! A total of **75 lucky winners** will be chosen, so submit your prediction in while you can.\n\n  \n\nPredict now right here: [https://bit.ly/3WQ2RPw](https://bit.ly/3WQ2RPw) \n\nWho will be crowned Champion?\n\nDon't miss the action on **February 21, starting at 18:00 UTC** to witness the clash and experience the thrill live!\n\n  \n\nPUBG: BATTLEGROUNDS Team."
  },
  {
    "title": "PUBG: BATTLEGROUNDS Weekly Bans Notice (02/10~02/16)",
    "date": "ANNOUNCEMENT 2025.02.19",
    "category": "PUBG",
    "platform": [],
    "link": "https://www.pubg.com/en/news/8244",
    "content": "Hello players!\n\nWe are sharing the banned players list for the past week to raise awareness about the abuse of illegal software and the consequences of misconduct. Please refer to the list of players who have been banned for violating rules of conduct.\n\n*   Investigation Period: 2025/02/10~2025/02/16\n*   Click [here](https://wstatic-prod-boc.krafton.com/common/content/news/20250218/H74mJBuC/250219_WKBL\\(0210_0216\\).pdf) for the full list of permanently banned accounts\n\n![](https://wstatic-prod-boc.krafton.com/common/news/20250218/RmcRJlzt.jpg)\n\n  \n\n※ The banned players list attached on this page shows the in-game nicknames of the permanently banned accounts, and the first 3 letters of each nickname have been replaced with \"\\*\".\n\n※ Please report illegal software and misconduct through in-game reports first and if you need additional assistance, please contact [PUBG Support](https://support.pubg.com/hc/en-us).\n\n※ To ensure that your valuable account is not abused or banned for using illegal software/misconduct, please make sure you sign up for Steam Guard Mobile Authenticator.\n\n[※ How to Set Up Steam Guard Mobile Authenticator](https://support.pubg.com/hc/en-us/articles/115004196114-How-do-I-set-up-Steam-Guard-)\n\n  \n\nWe highly value your interest and opinions that contribute to PUBG's anti-cheat efforts. \n\nWe will do our best to provide a fair gaming environment.\n\n  \n\nThank you.\n\nPUBG: BATTLEGROUNDS Anti-Cheat Team\n\nPUBG: BATTLEGROUNDS Team."
  },
  {
    "title": "PUBG: BATTLEGROUNDS Weekly Bans Notice (02/03~02/09)",
    "date": "ANNOUNCEMENT 2025.02.12",
    "category": "PUBG",
    "platform": [],
    "link": "https://www.pubg.com/en/news/8217",
    "content": "Hello players!\n\nWe are sharing the banned players list for the past week to raise awareness about the abuse of illegal software and the consequences of misconduct. Please refer to the list of players who have been banned for violating rules of conduct.\n\n*   Investigation Period: 2025/02/03~2025/02/09\n*   Click [here](https://wstatic-prod-boc.krafton.com/common/content/news/20250210/2kFpyiTu/250212_WKBL\\(0203_0209\\).pdf) for the full list of permanently banned accounts\n\n![](https://wstatic-prod-boc.krafton.com/common/news/20250210/4j9c3pto.jpg)\n\n  \n\n※ The banned players list attached on this page shows the in-game nicknames of the permanently banned accounts, and the first 3 letters of each nickname have been replaced with \"\\*\".\n\n※ Please report illegal software and misconduct through in-game reports first and if you need additional assistance, please contact [PUBG Support](https://support.pubg.com/hc/en-us).\n\n※ To ensure that your valuable account is not abused or banned for using illegal software/misconduct, please make sure you sign up for Steam Guard Mobile Authenticator.\n\n[※ How to Set Up Steam Guard Mobile Authenticator](https://support.pubg.com/hc/en-us/articles/115004196114-How-do-I-set-up-Steam-Guard-)\n\n  \n\nWe highly value your interest and opinions that contribute to PUBG's anti-cheat efforts. \n\nWe will do our best to provide a fair gaming environment.\n\n  \n\nThank you.\n\nPUBG: BATTLEGROUNDS Anti-Cheat Team\n\nPUBG: BATTLEGROUNDS Team."
  }
]
